---
kind: other
id: Properties.T:Autodesk.Revit.DB.ModelTextType
source: html/6b042cac-aba6-6084-77e5-499185bbb37b.htm
---
# ModelTextType Properties

The id of the assembly instance to which the element belongs.